; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 5801)
	(= (fuel plane1) 1267)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city1)
	(= (capacity plane2) 5486)
	(= (fuel plane2) 1491)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city3)
	(= (capacity plane3) 8409)
	(= (fuel plane3) 2336)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at person1 city3)
	(at person2 city3)
	(at person3 city2)
	(at person4 city0)
	(at person5 city0)
	(at person6 city0)
	(at person7 city0)
	(at person8 city0)
	(at person9 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 785)
	(= (distance city0 city2) 949)
	(= (distance city0 city3) 582)
	(= (distance city1 city0) 785)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 943)
	(= (distance city1 city3) 680)
	(= (distance city2 city0) 949)
	(= (distance city2 city1) 943)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 967)
	(= (distance city3 city0) 582)
	(= (distance city3 city1) 680)
	(= (distance city3 city2) 967)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city1)
	(at person6 city3)
	(at person7 city0)
	(at person8 city2)
	(at person9 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane3 city3)
   changed: (fuel plane3) from 2336 to 8409
   goals met: 1 of 9
2. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 9
3. (board person2 plane3 city3)
   deleted: (at person2 city3)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 9
4. (board person6 plane1 city0)
   deleted: (at person6 city0)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 9
5. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 1164, (fuel plane1) from 1267 to 103
   goals met: 1 of 9
6. (debark person6 plane1 city3)
   deleted: (in person6 plane1)
   added: (at person6 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 9
7. (board person9 plane3 city3)
   deleted: (at person9 city3)
   added: (in person9 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 9
8. (fly plane3 city3 city2)
   deleted: (at plane3 city3)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 1164 to 4065, (fuel plane3) from 8409 to 5508
   goals met: 2 of 9
9. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   changed: (onboard plane3) from 3 to 2
   goals met: 3 of 9
10. (board person3 plane3 city2)
   deleted: (at person3 city2)
   added: (in person3 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 3 of 9
11. (fly plane3 city2 city0)
   deleted: (at plane3 city2)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 4065 to 6912, (fuel plane3) from 5508 to 2661
   goals met: 3 of 9
12. (debark person2 plane3 city0)
   deleted: (in person2 plane3)
   added: (at person2 city0)
   changed: (onboard plane3) from 3 to 2
   goals met: 4 of 9
13. (debark person3 plane3 city0)
   deleted: (in person3 plane3)
   added: (at person3 city0)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 9
14. (board person4 plane3 city0)
   deleted: (at person4 city0)
   added: (in person4 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 5 of 9
15. (board person5 plane3 city0)
   deleted: (at person5 city0)
   added: (in person5 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 5 of 9
16. (board person8 plane3 city0)
   deleted: (at person8 city0)
   added: (in person8 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 5 of 9
17. (refuel plane3 city0)
   changed: (fuel plane3) from 2661 to 8409
   goals met: 5 of 9
18. (fly plane3 city0 city2)
   deleted: (at plane3 city0)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 6912 to 9759, (fuel plane3) from 8409 to 5562
   goals met: 5 of 9
19. (debark person4 plane3 city2)
   deleted: (in person4 plane3)
   added: (at person4 city2)
   changed: (onboard plane3) from 4 to 3
   goals met: 6 of 9
20. (debark person8 plane3 city2)
   deleted: (in person8 plane3)
   added: (at person8 city2)
   changed: (onboard plane3) from 3 to 2
   goals met: 7 of 9
21. (fly plane3 city2 city1)
   deleted: (at plane3 city2)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 9759 to 12588, (fuel plane3) from 5562 to 2733
   goals met: 7 of 9
22. (debark person5 plane3 city1)
   deleted: (in person5 plane3)
   added: (at person5 city1)
   changed: (onboard plane3) from 2 to 1
   goals met: 8 of 9
23. (debark person9 plane3 city1)
   deleted: (in person9 plane3)
   added: (at person9 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 9 of 9
